testCases/heatTransfer/testHT2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    bottom
    {
        type            patch;
        nFaces          180;
        startFace       107520;
    }
    sides
    {
        type            patch;
        nFaces          600;
        startFace       107700;
    }
    frontAndBack
    {
        type            symmetryPlane;
        nFaces          108000;
        startFace       108300;
    }
    top
    {
        type            patch;
        nFaces          180;
        startFace       216300;
    }
)

// ************************************************************************* //
