testCases/heatTransfer/testHT2/constant/reactions
species
(
    N2
    EMs
    EMg
);

reactions
{

}
